var Toc = [{
    "id": 1,
    "o": 232786,
    "text": "О Kaspersky Neuromorphic Platform",
    "url": "232786.htm",
    "node": "0",
    "children": [{
        "id": 2,
        "o": 232787,
        "text": "Комплект поставки",
        "url": "232787.htm",
        "node": "0+0",
        "leaf": true
    }, {
        "id": 3,
        "o": 232788,
        "text": "Аппаратные и программные требования",
        "url": "232788.htm",
        "node": "0+1",
        "leaf": true
    }, {
        "id": 4,
        "o": 235051,
        "text": "О бекенде Kaspersky Neuromorphic Platform",
        "url": "235051.htm",
        "node": "0+2",
        "leaf": true
    }, {
        "id": 5,
        "o": 244427,
        "text": "Обмен данными в Kaspersky Neuromorphic Platform",
        "url": "244427.htm",
        "node": "0+3",
        "leaf": true
    }]
}, {
    "id": 6,
    "o": 244808,
    "text": "Поддерживаемые бекенды",
    "url": "244808.htm",
    "node": "1",
    "children": [{
        "id": 7,
        "o": 272835,
        "text": "О работе бекенда для CPU",
        "url": "272835.htm",
        "node": "1+0",
        "leaf": true
    }, {
        "id": 8,
        "o": 272837,
        "text": "О нейроморфном процессоре Алтай-2",
        "url": "272837.htm",
        "node": "1+1",
        "leaf": true
    }]
}, {
    "id": 9,
    "o": 232883,
    "text": "Архитектура Kaspersky Neuromorphic Platform",
    "url": "232883.htm",
    "node": "2",
    "leaf": true
}, {
    "id": 10,
    "o": 272175,
    "text": "Компоненты платформы для использования на C++",
    "url": "272175.htm",
    "node": "3",
    "children": [{
        "id": 11,
        "o": 243537,
        "text": "Компоненты бекенда платформы для C++",
        "url": "243537.htm",
        "node": "3+0",
        "children": [{
            "id": 12,
            "o": 235738,
            "text": "Библиотека поддержки бекендов",
            "url": "235738.htm",
            "node": "3+0+0",
            "children": [{
                "id": 13,
                "o": 247366,
                "text": "Класс UID",
                "url": "247366.htm",
                "node": "3+0+0+0",
                "leaf": true
            }, {
                "id": 14,
                "o": 256488,
                "text": "Функция uid_hash",
                "url": "256488.htm",
                "node": "3+0+0+1",
                "leaf": true
            }, {
                "id": 15,
                "o": 248929,
                "text": "Класс continuously_uid_generator",
                "url": "248929.htm",
                "node": "3+0+0+2",
                "leaf": true
            }, {
                "id": 16,
                "o": 244933,
                "text": "Класс TagMap",
                "url": "244933.htm",
                "node": "3+0+0+3",
                "leaf": true
            }, {
                "id": 17,
                "o": 248867,
                "text": "Структура BaseData",
                "url": "248867.htm",
                "node": "3+0+0+4",
                "leaf": true
            }, {
                "id": 18,
                "o": 235842,
                "text": "Класс Population",
                "url": "235842.htm",
                "node": "3+0+0+5",
                "leaf": true
            }, {
                "id": 19,
                "o": 235844,
                "text": "Класс Projection",
                "url": "235844.htm",
                "node": "3+0+0+6",
                "leaf": true
            }, {
                "id": 20,
                "o": 235749,
                "text": "Класс Backend",
                "url": "235749.htm",
                "node": "3+0+0+7",
                "leaf": true
            }, {
                "id": 21,
                "o": 245461,
                "text": "Класс Device",
                "url": "245461.htm",
                "node": "3+0+0+8",
                "leaf": true
            }, {
                "id": 22,
                "o": 244932,
                "text": "Класс MessageBus",
                "url": "244932.htm",
                "node": "3+0+0+9",
                "leaf": true
            }, {
                "id": 23,
                "o": 247159,
                "text": "Класс MessageEndpoint",
                "url": "247159.htm",
                "node": "3+0+0+10",
                "leaf": true
            }, {
                "id": 24,
                "o": 250697,
                "text": "Класс Subscription",
                "url": "250697.htm",
                "node": "3+0+0+11",
                "leaf": true
            }, {
                "id": 25,
                "o": 243634,
                "text": "Пространство имен Messaging",
                "url": "243634.htm",
                "node": "3+0+0+12",
                "leaf": true
            }, {
                "id": 26,
                "o": 262482,
                "text": "Пространство имен synapse_access",
                "url": "262482.htm",
                "node": "3+0+0+13",
                "leaf": true
            }]
        }, {
            "id": 27,
            "o": 247186,
            "text": "Библиотека устройств",
            "url": "247186.htm",
            "node": "3+0+1",
            "leaf": true
        }, {
            "id": 28,
            "o": 235859,
            "text": "Библиотека характеристик нейронов",
            "url": "235859.htm",
            "node": "3+0+2",
            "leaf": true
        }, {
            "id": 29,
            "o": 235860,
            "text": "Библиотека характеристик синапсов",
            "url": "235860.htm",
            "node": "3+0+3",
            "leaf": true
        }, {
            "id": 30,
            "o": 245041,
            "text": "Библиотека шаблонов",
            "url": "245041.htm",
            "node": "3+0+4",
            "leaf": true
        }]
    }, {
        "id": 31,
        "o": 235050,
        "text": "Компоненты фреймворка для C++",
        "url": "235050.htm",
        "node": "3+1",
        "children": [{
            "id": 32,
            "o": 244944,
            "text": "Пространство имен input",
            "url": "244944.htm",
            "node": "3+1+0",
            "leaf": true
        }, {
            "id": 33,
            "o": 243539,
            "text": "Пространство имен output",
            "url": "243539.htm",
            "node": "3+1+1",
            "leaf": true
        }, {
            "id": 34,
            "o": 235753,
            "text": "Набор классов Coordinates",
            "url": "235753.htm",
            "node": "3+1+2",
            "leaf": true
        }, {
            "id": 35,
            "o": 260375,
            "text": "Класс MessageObserver",
            "url": "260375.htm",
            "node": "3+1+3",
            "leaf": true
        }, {
            "id": 36,
            "o": 235801,
            "text": "Класс Network",
            "url": "235801.htm",
            "node": "3+1+4",
            "leaf": true
        }, {
            "id": 37,
            "o": 235849,
            "text": "Класс Model",
            "url": "235849.htm",
            "node": "3+1+5",
            "leaf": true
        }, {
            "id": 38,
            "o": 251296,
            "text": "Класс ModelExecutor",
            "url": "251296.htm",
            "node": "3+1+6",
            "leaf": true
        }, {
            "id": 39,
            "o": 243548,
            "text": "Класс BackendLoader",
            "url": "243548.htm",
            "node": "3+1+7",
            "leaf": true
        }]
    }]
}, {
    "id": 40,
    "o": 272176,
    "text": "Компоненты платформы для использования на Python",
    "url": "272176.htm",
    "node": "4",
    "children": [{
        "id": 41,
        "o": 272177,
        "text": "Компоненты бекенда платформы для Python",
        "url": "272177.htm",
        "node": "4+0",
        "children": [{
            "id": 42,
            "o": 272188,
            "text": "Библиотека поддержки бекендов",
            "url": "272188.htm",
            "node": "4+0+0",
            "children": [{
                "id": 43,
                "o": 272192,
                "text": "Класс UID",
                "url": "272192.htm",
                "node": "4+0+0+0",
                "leaf": true
            }, {
                "id": 44,
                "o": 272227,
                "text": "Класс uid_hash",
                "url": "272227.htm",
                "node": "4+0+0+1",
                "leaf": true
            }, {
                "id": 45,
                "o": 272229,
                "text": "Класс UUID",
                "url": "272229.htm",
                "node": "4+0+0+2",
                "leaf": true
            }, {
                "id": 46,
                "o": 272193,
                "text": "Класс continuously_uid_generator",
                "url": "272193.htm",
                "node": "4+0+0+3",
                "leaf": true
            }, {
                "id": 47,
                "o": 272194,
                "text": "Класс TagMap",
                "url": "272194.htm",
                "node": "4+0+0+4",
                "leaf": true
            }, {
                "id": 48,
                "o": 272195,
                "text": "Структура BaseData",
                "url": "272195.htm",
                "node": "4+0+0+5",
                "leaf": true
            }, {
                "id": 49,
                "o": 272196,
                "text": "Набор классов Population",
                "url": "272196.htm",
                "node": "4+0+0+6",
                "leaf": true
            }, {
                "id": 50,
                "o": 272197,
                "text": "Набор классов Projection",
                "url": "272197.htm",
                "node": "4+0+0+7",
                "leaf": true
            }, {
                "id": 51,
                "o": 272198,
                "text": "Класс Backend",
                "url": "272198.htm",
                "node": "4+0+0+8",
                "leaf": true
            }, {
                "id": 52,
                "o": 272199,
                "text": "Класс MessageBus",
                "url": "272199.htm",
                "node": "4+0+0+9",
                "leaf": true
            }, {
                "id": 53,
                "o": 272200,
                "text": "Класс MessageEndpoint",
                "url": "272200.htm",
                "node": "4+0+0+10",
                "leaf": true
            }, {
                "id": 54,
                "o": 272201,
                "text": "Набор классов Subscription",
                "url": "272201.htm",
                "node": "4+0+0+11",
                "leaf": true
            }, {
                "id": 55,
                "o": 272202,
                "text": "Пространство имен Messaging",
                "url": "272202.htm",
                "node": "4+0+0+12",
                "leaf": true
            }]
        }, {
            "id": 56,
            "o": 272189,
            "text": "Библиотека характеристик нейронов",
            "url": "272189.htm",
            "node": "4+0+1",
            "leaf": true
        }, {
            "id": 57,
            "o": 272190,
            "text": "Библиотека характеристик синапсов",
            "url": "272190.htm",
            "node": "4+0+2",
            "leaf": true
        }]
    }, {
        "id": 58,
        "o": 240225,
        "text": "Компоненты Python-фреймворка",
        "url": "240225.htm",
        "node": "4+1",
        "children": [{
            "id": 59,
            "o": 273090,
            "text": "Библиотека ANN2SNN",
            "url": "273090.htm",
            "node": "4+1+0",
            "leaf": true
        }, {
            "id": 60,
            "o": 273444,
            "text": "Тернарные слои библиотеки ANN2SNN",
            "url": "273444.htm",
            "node": "4+1+1",
            "leaf": true
        }, {
            "id": 61,
            "o": 272051,
            "text": "Класс BackendLoader",
            "url": "272051.htm",
            "node": "4+1+2",
            "leaf": true
        }]
    }]
}, {
    "id": 62,
    "o": 235594,
    "text": "Сторонние библиотеки и используемые форматы",
    "url": "235594.htm",
    "node": "5",
    "children": [{
        "id": 63,
        "o": 235876,
        "text": "Сторонние библиотеки",
        "url": "235876.htm",
        "node": "5+0",
        "leaf": true
    }, {
        "id": 64,
        "o": 235877,
        "text": "Форматы данных, обрабатываемые платформой",
        "url": "235877.htm",
        "node": "5+1",
        "leaf": true
    }, {
        "id": 65,
        "o": 235878,
        "text": "Форматы описания нейронной сети",
        "url": "235878.htm",
        "node": "5+2",
        "leaf": true
    }]
}, {
    "id": 66,
    "o": 235045,
    "text": "Установка и удаление платформы",
    "url": "235045.htm",
    "node": "6",
    "children": [{
        "id": 67,
        "o": 273773,
        "text": "Установка deb-пакетов",
        "url": "273773.htm",
        "node": "6+0",
        "leaf": true
    }, {
        "id": 68,
        "o": 273774,
        "text": "Установка пакетов для разработки на языке программирования Python",
        "url": "273774.htm",
        "node": "6+1",
        "leaf": true
    }, {
        "id": 69,
        "o": 235046,
        "text": "Загрузка и распаковка архива с исходным кодом платформы",
        "url": "235046.htm",
        "node": "6+2",
        "leaf": true
    }, {
        "id": 70,
        "o": 255715,
        "text": "Сборка проекта для разработки решений на C++",
        "url": "255715.htm",
        "node": "6+3",
        "leaf": true
    }, {
        "id": 71,
        "o": 255720,
        "text": "Удаление платформы",
        "url": "255720.htm",
        "node": "6+4",
        "leaf": true
    }]
}, {
    "id": 72,
    "o": 255811,
    "text": "Участие в разработке платформы",
    "url": "255811.htm",
    "node": "7",
    "leaf": true
}, {
    "id": 73,
    "o": 235890,
    "text": "Лицензирование платформы",
    "url": "235890.htm",
    "node": "8",
    "leaf": true
}, {
    "id": 74,
    "o": 235889,
    "text": "О предоставлении данных",
    "url": "235889.htm",
    "node": "9",
    "leaf": true
}, {
    "id": 75,
    "o": 272341,
    "text": "Решение типовых задач на C++",
    "url": "272341.htm",
    "node": "10",
    "children": [{
        "id": 76,
        "o": 250649,
        "text": "Добавление нового типа нейрона",
        "url": "250649.htm",
        "node": "10+0",
        "leaf": true
    }, {
        "id": 77,
        "o": 250824,
        "text": "Добавление нового типа синапса",
        "url": "250824.htm",
        "node": "10+1",
        "leaf": true
    }, {
        "id": 78,
        "o": 256877,
        "text": "Исполнение нейронной сети, загруженной на бекенд автоматически",
        "url": "256877.htm",
        "node": "10+2",
        "leaf": true
    }, {
        "id": 79,
        "o": 245069,
        "text": "Исполнение нейронной сети, созданной из проекций и популяций",
        "url": "245069.htm",
        "node": "10+3",
        "leaf": true
    }]
}, {
    "id": 80,
    "o": 272352,
    "text": "Решение типовых задач на Python",
    "url": "272352.htm",
    "node": "11",
    "children": [{
        "id": 81,
        "o": 272357,
        "text": "Исполнение нейронной сети, загруженной на бекенд вручную",
        "url": "272357.htm",
        "node": "11+0",
        "leaf": true
    }, {
        "id": 82,
        "o": 273512,
        "text": "Сценарий исполнения нейронной сети из тернарных слоев для классификации изображений",
        "url": "273512.htm",
        "node": "11+1",
        "children": [{
            "id": 83,
            "o": 273484,
            "text": "Создание и обучение нейронной сети из тернарных слоев для классификации изображений",
            "url": "273484.htm",
            "node": "11+1+0",
            "leaf": true
        }, {
            "id": 84,
            "o": 273538,
            "text": "Запуск инференса нейронной сети из тернарных слоев для классификации изображений",
            "url": "273538.htm",
            "node": "11+1+1",
            "leaf": true
        }]
    }, {
        "id": 85,
        "o": 273724,
        "text": "Создание и обучение регрессионной модели",
        "url": "273724.htm",
        "node": "11+2",
        "leaf": true
    }]
}, {
    "id": 86,
    "o": 240504,
    "text": "Использование Kaspersky Neuromorphic Platform API",
    "url": "240504.htm",
    "node": "12",
    "leaf": true
}, {
    "id": 87,
    "o": 90,
    "text": "Глоссарий",
    "url": "90.htm",
    "node": "13",
    "children": [{
        "id": 88,
        "o": 251916,
        "text": "Бекенд",
        "url": "90.htm#o251916",
        "node": "13+0",
        "leaf": true
    }, {
        "id": 89,
        "o": 251925,
        "text": "Вес синапса",
        "url": "90.htm#o251925",
        "node": "13+1",
        "leaf": true
    }, {
        "id": 90,
        "o": 251918,
        "text": "Вычислитель",
        "url": "90.htm#o251918",
        "node": "13+2",
        "leaf": true
    }, {
        "id": 91,
        "o": 251926,
        "text": "Модификатор",
        "url": "90.htm#o251926",
        "node": "13+3",
        "leaf": true
    }, {
        "id": 92,
        "o": 251914,
        "text": "Нейрон",
        "url": "90.htm#o251914",
        "node": "13+4",
        "leaf": true
    }, {
        "id": 93,
        "o": 264599,
        "text": "Период ППС",
        "url": "90.htm#o264599",
        "node": "13+5",
        "leaf": true
    }, {
        "id": 94,
        "o": 264601,
        "text": "Плотная последовательность спайков (ППС)",
        "url": "90.htm#o264601",
        "node": "13+6",
        "leaf": true
    }, {
        "id": 95,
        "o": 251919,
        "text": "Популяция",
        "url": "90.htm#o251919",
        "node": "13+7",
        "leaf": true
    }, {
        "id": 96,
        "o": 251920,
        "text": "Проекция",
        "url": "90.htm#o251920",
        "node": "13+8",
        "leaf": true
    }, {
        "id": 97,
        "o": 251915,
        "text": "Синапс",
        "url": "90.htm#o251915",
        "node": "13+9",
        "leaf": true
    }, {
        "id": 98,
        "o": 251924,
        "text": "Синаптическое воздействие",
        "url": "90.htm#o251924",
        "node": "13+10",
        "leaf": true
    }, {
        "id": 99,
        "o": 251929,
        "text": "Соединение",
        "url": "90.htm#o251929",
        "node": "13+11",
        "leaf": true
    }, {
        "id": 100,
        "o": 251921,
        "text": "Спайк",
        "url": "90.htm#o251921",
        "node": "13+12",
        "leaf": true
    }, {
        "id": 101,
        "o": 273641,
        "text": "Такт",
        "url": "90.htm#o273641",
        "node": "13+13",
        "leaf": true
    }, {
        "id": 102,
        "o": 273599,
        "text": "Тик",
        "url": "90.htm#o273599",
        "node": "13+14",
        "leaf": true
    }, {
        "id": 103,
        "o": 251917,
        "text": "Фреймворк",
        "url": "90.htm#o251917",
        "node": "13+15",
        "leaf": true
    }, {
        "id": 104,
        "o": 251927,
        "text": "Функция нейрона",
        "url": "90.htm#o251927",
        "node": "13+16",
        "leaf": true
    }, {
        "id": 105,
        "o": 251928,
        "text": "Функция синапса",
        "url": "90.htm#o251928",
        "node": "13+17",
        "leaf": true
    }]
}, {
    "id": 106,
    "o": 262312,
    "text": "Информация о стороннем коде",
    "url": "262312.htm",
    "node": "14",
    "leaf": true
}, {
    "id": 107,
    "o": 240611,
    "text": "Уведомления о товарных знаках",
    "url": "240611.htm",
    "node": "15",
    "leaf": true
}];